{
  "architectures": [
    "PTPForConditionalGeneration"
  ],
  "model_type": "ptp",
  "pad_token_id": 1,
  "torch_dtype": "float32",
  "tie_word_embeddings": true,
  "text_config": {
    "emb_layer_norm": true,
    "d_ff": 3072,
    "d_kv": 64,
    "decoder_start_token_id": 0,
    "dense_act_fn": "gelu_new",
    "dropout_rate": 0.1,
    "attention_dropout": 0.1,
    "encoder_hidden_size": 768,
    "hidden_size": 768,
    "initializer_factor": 1.0,
    "initializer_range": 0.02,
    "is_decoder": true,
    "is_encoder_decoder": false,
    "layer_norm_epsilon": 1e-06,
    "model_type": "ptp_text_decoder",
    "num_heads": 12,
    "num_layers": 12,
    "pad_token_id": 1,
    "tie_word_embeddings": true,
    "vocab_size": 50265
  },
  "vision_config": {
    "attention_probs_dropout_prob": 0.1,
    "decoder_hidden_size": 512,
    "decoder_intermediate_size": 2048,
    "decoder_num_attention_heads": 16,
    "decoder_num_hidden_layers": 8,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 768,
    "image_size": [
      16,
      8176
    ],
    "initializer_factor": 1.0,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-12,
    "model_type": "ptp_vision",
    "norm_pix_loss": true,
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "patch_size": 16,
    "qkv_bias": true,
    "torch_dtype": "float32"
  }
}
